/************************************************************/
/*  程式名稱：影像繪圖										*/
/*  作者姓名：卓諭                                           */
/*	    學號:106318025                                      */
/*  指導教授：Dr.黃正民                                      */
/*  電子郵件：t106318025@ntut.org.tw                         */
/*                                                          */
/*  問題描述：這個程式將輸入的.raw檔灰階圖像，                  */
/*           加上幾何圖形以及文字，並且存成.png檔              */
/*                                                          */
/*  輸入檔案：lena512.raw					                    */
/*  輸出檔案：利用imshow顯示一個二維矩陣(灰階圖像)              */
/*  需求項目：無                                             */
/************************************************************/
#include <cstdio>
#include <opencv2/opencv.hpp>

using namespace cv;

int main()
{
	FILE *filein;//利用C++函示庫宣告一個filein以存放開啟檔案後的位址
	Mat figure(512, 512, CV_8UC1, Scalar(0));//利用OpenCV函示庫宣告一個256*256的矩陣空間
	int i, j;
	int row = 512;
	int col = 512;
	/*-----------------------------------------------開啟.raw檔並將每一像素值加80------------------------------*/
	filein = fopen("lena512.raw", "rb");
	for (j = 0; j < row; j++)
	{
		for (i = 0; i < col; i++)
		{
			figure.data[i + j*row] = fgetc(filein);
		}
	}
	/*-------------------------------------------------------------------------------------------------------*/
	/*-----------------------------------------------加入圖形與文字--------------------------------------------*/
	circle(figure, Point(265, 265), 3, Scalar::all(255), 12, 8, 0);
	circle(figure, Point(265, 265), 30, Scalar::all(255), 5, 8, 0);
	circle(figure, Point(265, 265), 90, Scalar::all(255), 5, 8, 0);
	circle(figure, Point(265, 265), 150, Scalar::all(255), 5, 8, 0);
	line(figure, Point(115, 265), Point(415, 265), Scalar::all(0), 1, 8, 0);
	line(figure, Point(265, 115), Point(265, 415), Scalar::all(0), 1, 8, 0);
	putText(figure, "106318025", Point(80, 475), FONT_HERSHEY_DUPLEX, 2, Scalar::all(255),4,8,false);
	/*-------------------------------------------------------------------------------------------------------*/
	/*----------------------------------------------顯示random的圖--------------------------------------------*/
	imshow("draw_graph", figure);
	waitKey(0);
	/*--------------------------------------------------------------------------------------------------------*/
	/*------------------------------------------------儲存成.png檔---------------------------------------------*/
	imwrite("drawing graph.png", figure);
	fclose(filein);
	/*--------------------------------------------------------------------------------------------------------*/
}