/************************************************************/
/*  程式名稱：提高影像亮度    	    						    */
/*  作者姓名：卓諭                                           */
/*	    學號:106318025                                      */
/*  指導教授：Dr.黃正民                                      */
/*  電子郵件：t106318025@ntut.org.tw                         */
/*                                                          */
/*  問題描述：這個程式將輸入的.raw檔灰階圖像，每個pixel都增加    */
/*           80的強度值，且不能造成溢位，將最後的圖像資訊顯示    */
/*           並存成.raw檔                                    */
/*                                                          */
/*  輸入檔案：lena256.raw					                    */
/*  輸出檔案：利用imshow顯示一個二維矩陣(灰階圖像)              */
/*  需求項目：無                                             */
/************************************************************/
#include <cstdio>
#include <opencv2/opencv.hpp>

using namespace cv;

int main()
{
	FILE *filein;//利用C++函示庫宣告一個filein以存放開啟檔案後的位址
	Mat figure(256, 256, CV_8UC1, Scalar(0));//利用OpenCV函示庫宣告一個256*256的矩陣空間
	int i, j;
	int row = 256;
	int col = 256;
	/*-----------------------------------------------開啟.raw檔並將每一像素值加80------------------------------------------------------*/
	filein = fopen("lena256.raw", "rb");
	for (j = 0; j < row; j++)
	{
		for (i = 0; i < col; i++)
		{
			figure.data[i + j*row] = fgetc(filein);
			if (figure.data[i + j*row] >= 175)//判斷若原像素值大於(255-80)則直接設定為255
			{
				figure.data[i + j*row] = 255;
			}
			else//否則將原像素值加80
				figure.data[i + j*row] = figure.data[i + j*row] + 80;
		}
	}
	/*-----------------------------------------------------------------------------------------------------------------------------*/
	/*----------------------------------------------------------顯示random的圖-------------------------------------------------------*/
	imshow("Brightness", figure);
	waitKey(0);
	/*------------------------------------------------------------------------------------------------------------------------------*/
	/*-----------------------------------------------------------儲存成.raw檔--------------------------------------------------------*/
	FILE *store;
	store = fopen("Brightness.raw", "w+b");
	fwrite(figure.data, 1, 65536, store);
	fclose(store);
	/*------------------------------------------------------------------------------------------------------------------------------*/
}